#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура Массивы(Команда)
	МассивыНаСервере();
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервереБезКонтекста
Процедура МассивыНаСервере()
	// Изучение массивов
	Массив = Новый Массив();
	
	
	Массив.Добавить("Строка");
	Массив.Добавить(4);
	Массив.Добавить('20230101');
	Массив.Добавить(Неопределено);
	Массив.Добавить(Истина);
	
	
	ИндексМассива = Массив.ВГраница();
	Для Каждого Стр Из Массив Цикл
		
		Сообщить(Стр);
		
		
	КонецЦикла; 

КонецПроцедуры


#КонецОбласти